<a href="https://colab.research.google.com/github/JoanYego/MTN-Project/blob/master/Week_3_IP_Joan_Yego.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Importing Pandas and Numpy Libraries**

In [ ]:
import pandas as pd
import numpy as np

**Reading csv files to Colab Notebook**

In [ ]:
# Here we are creating a DataFrame using the content of the csv file named cells_geo.csv

df1 = pd.read_csv('cells_geo.csv')
df1.columns = ['INDEX', 'VILLES', 'STATUS', 'LOCALISATION', 'DECOUPZONE', 'ZONENAME', 'LONGITUDE',
              'LATITUDE', 'REGION', 'AREA', 'CELL_ID', 'SITE_CODE']
df1.head(4)

   INDEX   VILLES      STATUS  ... AREA     CELL_ID   SITE_CODE
0      0   ADJAME  In Service  ...  NaN  fbb2e75af3  0bb492ef17
1      1   ADJAME  In Service  ...  NaN  1502501d78  0bb492ef17
2      2   ADJAME  In Service  ...  NaN  0c2e182a0c  0bb492ef17
3      3  ASSINIE  In Service  ...  NaN  69bdfc69fd  8a1e6ce31f

[4 rows x 12 columns]

In [ ]:
# Here we are creating another DataFrame using the content of the csv file named Telcom_dataset1.csv
# This is for data records with the date 2012/05/07
# We are also defining the missing values in the relevant columns


df7 = pd.read_csv('Telcom_dataset1.csv')
df7.head(2)

  PRODUTC  VALUE DATETIME  ... COUNTRY_B     CELL_ID     SITE_ID
0   Voice      0  04:37.0  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu
1     sms      0  05:25.0  ...     19e2e  /+cKZKIp41  /+cKZKIp41

[2 rows x 10 columns]

In [ ]:
# Creating a DataFrame using the content of the csv file named Telcom_dataset2.csv
# This is for data records with the date 2012/05/08
# We are also defining the missing values in the relevant columns


df8 = pd.read_csv('Telcom_dataset2.csv')
df8.head(2)

  PRODUCT  VALUE DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0     sms      0   02:06.0  ...     19e2e  +854AcBQT2  +854AcBQT2
1   Voice      0   03:44.0  ...     19e2e  +854AcBQT2  +854AcBQT2

[2 rows x 10 columns]

In [ ]:
# Here we are creating a final DataFrame using the content of the csv file named Telcom_dataset3.csv
# This is for data records with the date 2012/05/09
# We are also defining the missing values in the relevant columns

df9 = pd.read_csv('Telcom_dataset3.csv')
df9.head(3)

  PRODUCT  VALUE DATE_TIME  ... COUNTRY_B      CELLID     SIET_ID
0   Voice     61   01:28.0  ...     19e2e  +38u2u/rfx  +38u2u/rfx
1     sms      0   01:31.0  ...     19e2e      #NAME?      #NAME?
2   Voice     10   02:59.0  ...     19e2e  +ZaaZozy/+  +ZaaZozy/+

[3 rows x 10 columns]

**Data Cleaning**

In [ ]:
# For DataFrame 1:
# Updating the column names so that they are all correctly spelled
# Writing the column names in all lowercase
#Changing the column name VILLES to CITY for DataFrame_1

df1.columns = ['index', 'city', 'status', 'localisation', 'decoupzone', 'zonename', 'longitude',
              'latitude', 'region', 'area', 'cell_id', 'site_id']
df1.head(4)

   index     city      status  ... area     cell_id     site_id
0      0   ADJAME  In Service  ...  NaN  fbb2e75af3  0bb492ef17
1      1   ADJAME  In Service  ...  NaN  1502501d78  0bb492ef17
2      2   ADJAME  In Service  ...  NaN  0c2e182a0c  0bb492ef17
3      3  ASSINIE  In Service  ...  NaN  69bdfc69fd  8a1e6ce31f

[4 rows x 12 columns]

In [ ]:
# Updating the column names for the last 3 DataFrames to ensure uniformity
# which could come in handy when merging DataFrames
# Also changing the DATE_TIME column name to TIME 
# which is a more accurate description of the content of that column
# This data cleaning step also corrects column misspellings in the original dataset
# to ensure that the attribute name represents the content of that attribute
# Finally we need to specify the null values

df7.columns = ['product', 'value', 'time', 'cell_on_site', 'dw_a_number', 'dw_b_number', 'country_a',
              'country_b', 'cell_id', 'site_id']
df7.loc[df7['cell_id'] == '#NAME?','cell_id'] = np.nan
df7.loc[df7['site_id'] == '#NAME?','site_id'] = np.nan
df7.head(4)

df8.columns = ['product', 'value', 'time', 'cell_on_site', 'dw_a_number', 'dw_b_number', 'country_a',
              'country_b', 'cell_id', 'site_id']
df8.loc[df8['cell_id'] == '#NAME?','cell_id'] = np.nan
df8.loc[df8['site_id'] == '#NAME?','site_id'] = np.nan
df8.head(4)

df9.columns = ['product', 'value', 'time', 'cell_on_site', 'dw_a_number', 'dw_b_number', 'country_a',
              'country_b', 'cell_id', 'site_id']
df9.loc[df9['cell_id'] == '#NAME?','cell_id'] = np.nan
df9.loc[df9['site_id'] == '#NAME?','site_id'] = np.nan

df9.head(4)

  product  value     time  ... country_b     cell_id     site_id
0   Voice     61  01:28.0  ...     19e2e  +38u2u/rfx  +38u2u/rfx
1     sms      0  01:31.0  ...     19e2e         NaN         NaN
2   Voice     10  02:59.0  ...     19e2e  +ZaaZozy/+  +ZaaZozy/+
3     sms      0  03:04.0  ...     19e2e         NaN         NaN

[4 rows x 10 columns]

In [ ]:
# Checking for duplicate values
# as we can see when we execute the commands below there are no duplicates in 
# all three DataFrames

df1.duplicated()
df7.duplicated()
df8.duplicated()
df9.duplicated()

0       False
1       False
2       False
3       False
4       False
        ...
3969    False
3970    False
3971    False
3972    False
3973    False
Length: 3974, dtype: bool

In [ ]:
# Missing Values
# Executing the commands below show that all four DataFrames have missing values

df1.isnull()
df7.isnull()
df8.isnull()
df9.isnull()

      product  value   time  ...  country_b  cell_id  site_id
0       False  False  False  ...      False    False    False
1       False  False  False  ...      False     True     True
2       False  False  False  ...      False    False    False
3       False  False  False  ...      False     True     True
4       False  False  False  ...      False    False    False
...       ...    ...    ...  ...        ...      ...      ...
4996    False  False  False  ...      False    False    False
4997    False  False  False  ...      False    False    False
4998    False  False  False  ...      False    False    False
4999    False  False  False  ...      False    False    False
5000    False  False  False  ...      False    False    False

[5001 rows x 10 columns]

**Data Transformation**

In [ ]:
# Adding a day column to DataFrames labelled 7,8,9
# this will allow us to group merged data
df7 = df7.assign(date = '2012-05-07')
df7

df8 = df8.assign(date = '2012-05-08')
df8

df9 = df9.assign(date = '2012-05-09')
df9.head(4)

  product  value     time  ...     cell_id     site_id        date
0   Voice     61  01:28.0  ...  +38u2u/rfx  +38u2u/rfx  2012-05-09
1     sms      0  01:31.0  ...         NaN         NaN  2012-05-09
2   Voice     10  02:59.0  ...  +ZaaZozy/+  +ZaaZozy/+  2012-05-09
3     sms      0  03:04.0  ...         NaN         NaN  2012-05-09

[4 rows x 11 columns]

In [ ]:
# Combining all three DatatFrames 7,8 and 9
# Since the have the same attributes, structure and data content
df = pd.concat([df7, df8, df9])
df.head

<bound method NDFrame.head of      product  value     time  ...     cell_id     site_id        date
0      Voice      0  04:37.0  ...  /TJNe+Mmtu  /TJNe+Mmtu  2012-05-07
1        sms      0  05:25.0  ...  /+cKZKIp41  /+cKZKIp41  2012-05-07
2        sms     25  05:41.0  ...  /u0FSD+ahi  /u0FSD+ahi  2012-05-07
3      Voice     56  05:42.0  ...         NaN         NaN  2012-05-07
4      Voice     14  06:29.0  ...  051KhYDCpv  051KhYDCpv  2012-05-07
...      ...    ...      ...  ...         ...         ...         ...
4996   Voice      0  01:43.0  ...  2aa04dcab7  f7d63a29e5  2012-05-09
4997   Voice     62  01:43.0  ...  7f1f2f889f  b4ddb9e93c  2012-05-09
4998   Voice     32  01:43.0  ...  a4731e780e  d68260ef50  2012-05-09
4999   Voice     30  01:43.0  ...  98ed726da2  b4130b54ab  2012-05-09
5000   Voice     60  01:43.0  ...  1c11a2fcbb  6d70dae094  2012-05-09

[15003 rows x 11 columns]>

**DATA ANALYSIS**

In [ ]:
# Join the concatenated DataFrame df with the cells_geo DataFrame i.e df1
# I will use an inner join to make this merge
# First I will drop the cell id column on the cells_geo DataFrame
# This is because there are several cell ids per site but we are only intrested in the cell ids
# that have other relevant data like value and product which is containted in the concatenated table above
# I also deleted duplicates
df1_a = df1.drop(columns=['cell_id','index'])
df1_a
df1_b = df1_new.drop_duplicates()
df1_final = df1_b[df1_b['status'] == 'In Service']
df1_final

df_all = pd.merge(df, df1_final, how='inner', on='site_id')
df_all.tail(4)

      product  value     time  ...  latitude             region           area
10547     sms      0  01:42.0  ...  5.138750          SUD COMOE  ABIDJAN SOUTH
10548   Voice     47  01:42.0  ...  6.843278           MARAHOUE   CENTRE NORTH
10549   Voice     17  01:42.0  ...  5.349442             LAGUNE  ABIDJAN NORTH
10550     sms      0  01:43.0  ...  7.777056  VALLEE DU BANDAMA   CENTRE NORTH

[4 rows x 20 columns]

**Below are some analysis question that would help when coming up with a strategy.**

**1)Which ones were the most used city for the three days?**

In [ ]:
# We can use the count operation to count the number of times
# each city appered in the consolidated dataset
# After executing the code below, we can see that YOPOUGON was the most used city

df_all.city.value_counts()

YOPOUGON     1666
ABOBO        1186
COCODY        763
ADJAME        499
KOUMASSI      452
             ...
SAHUE           1
AGONDA          1
MAHAPLEU        1
PETIONARA       1
KLOTOU          1
Name: city, Length: 400, dtype: int64

**2) How frequently was each product used in the dataset**

In [ ]:
# Here I am using the group by and count function 
# on a subset of the DataFrame in previous question

df_price = df_all[['product', 'date', 'value']]
df_price.groupby([ df_price['product']]).count()

         date  value
product
Voice    4656   4656
sms      5895   5895

**3) What was the total billing price for each product in the dataset?**

In [ ]:
# Here I am using the group by and sum aggregate function

df_price.groupby(['product', 'date']).sum()

                    value
product date
Voice   2012-05-07  96033
        2012-05-08  90332
        2012-05-09  72723
sms     2012-05-07  11603
        2012-05-08  10738
        2012-05-09  25476

**4)Which localisation by product were the most used in the dataset?**

In [ ]:
# We can respond to this question using the group by and  count function

df_region = df_all[['region', 'localisation', 'product']]
df_region.groupby(['localisation', 'product']).count()

                      region
localisation product
ABIDJAN      Voice      2386
             sms        3818
INTERIEUR    Voice      2270
             sms        2077